{
    "English": "Engleză",
    "Română": "Română",
    "MyFitGlyph": "MyFitGlyph",
    "Login": "Autentificare",
    "Logout": "Delogare",
    "Register": "Înregistrare",
    "Username": "Nume de utilizator",
    "Email": "Email",
    "Password": "Parolă",
    "LOGIN": "AUTENTIFICARE",
    "REGISTER": "ÎNREGISTRARE",
    "Chats": "Conversații",
    "Chat Rooms": "Topicuri de conversații",
    "Message": "Mesaj - {{roomName}}",
    "Home": "Acasă",
    "Meals": "Mese",
    "Workouts": "Antrenamente",
    "Profile": "Profil",
    "Chat": "Conversație",
    "Language": "Limbă",
    "App Guide": "Ghid",
    "Read this guide to understand how to use the app": "Citește acest ghid pentru a înțelege cum să folosești aplicația",
    "About": "Despre",
    "Settings": "Setări",
    "Select language": "Selectează limba",
    "Communicate with other users": "Comunică cu alți utilizatori",
    "Remaining Calories": "Calorii rămase",
    "Add Photo": "Foto",
    "calories": "Calorii",
    "carbs": "Carbo",
    "protein": "Proteine",
    "fats": "Grăsimi",
    "Calories": "Calorii",
    "Carbs": "Carbo",
    "Protein": "Proteine",
    "Fats": "Grăsimi",
    "Delete Meal": "Șterge masă",
    "Are you sure you want to delete this meal?": "Sigur dorești să ștergi această masă?",
    "Cancel": "Anulează",
    "Delete": "Șterge",
    "Selected Date": "Data selectată",
    "Add Meal": "Adaugă masă",
    "No foods added": "Niciun aliment adăugat",
    "Add Food": "Adaugă aliment",
    "Move": "Mută",
    "Meal": "Masa",
    "Select a Food Category": "Selectează o categorie de alimente",
    "Search in": "Caută în {{category}}",
    "Invalid input": "Gramaj invalid",
    "Please enter a valid number for grams.": "Te rog introdu un număr valid de grame.",
    "Not enough calories": "Insuficiente calorii rămase",
    "remaining_calories_message": "Mai ai doar {{remaining}} calorii rămase. Elimină unele alimente sau redu gramajul.",
    "Food Details": "Detalii aliment",
    "Name": "Nume",
    "Default grams": "Gramaj implicit",
    "Enter new grams": "Introdu gramaj nou",
    "Save": "Salvează",
    "Month": "Luna",
    "Week": "Săptămâna",
    "Day": "Ziua",
    "Day Split": "zile de antrenament",
    "Equipment": "Echipament",
    "Primary muscle": "Mușchi principal",
    "Secondary muscle": "Mușchi secundar",
    "Tertiary muscle": "Mușchi terțiar",
    "No video available for this exercise": "Videoclip indisponibil pentru acest exercițiu",
    "Close": "Închide",
    "Swap": "Înlocuiește",
    "swap_for": "cu",
    "Male": "Bărbat",
    "Female": "Femeie",
    "Not Very Active": "Nu foarte activ",
    "Light Active": "Activitate ușoară",
    "Active": "Activ",
    "Very Active": "Foarte activ",
    "Fat Loss": "Slăbire",
    "Maintenance": "Menținere",
    "Muscle Gain": "Crestere în masă musculară",
    "Beginner": "Începător",
    "Intermediate": "Intermediar",
    "Advanced": "Avansat",
    "Error": "Eroare",
    "Success": "Succes",
    "No auth token found. Please log in again": "Token de autentificare lipsă. Te rog loghează-te din nou",
    "All fields must be filled in before saving": "Toate câmpurile trebuie completate înainte de salvare",
    "Date of birth must be at least one year before today": "Data nașterii trebuie să fie cu cel puțin un an mai mică decât data de azi",
    "Profile updated successfully": "Profil actualizat cu succes",
    "Failed to update profile": "Actualizarea profilului a eșuat",
    "Photo": "Poză de profil",
    "Height": "Înălțime",
    "Weight": "Greutate",
    "Date of Birth": "Data nașterii",
    "Activity Level": "Nivel de activitate",
    "Objective": "Obiectiv",
    "Experience": "Experiență",
    "Training Days": "Zile de antrenament",
    "Save Profile": "Salvează profil",
    "Full Body": "Întregul corp",
    "Upper": "Partea superioară",
    "Lower": "Partea inferioară",
    "Push": "Împins",
    "Pull": "Tras",
    "Legs": "Picioare",
    "Arms & Shoulders": "Brațe & Umeri",
    "No weight history available": "Istoric greutate indisponibil",
    "Welcome to MyFitGlyph Guide": "Bine ai venit la ghidul MyFitGlyph",
    "1. Getting Started": "1. Începe",
    "• Sign up for a new account or log in with your existing credentials.": "• Creează un cont nou sau loghează-te cu datele tale existente.",
    "• Upon login, you’ll land on the Home Screen. To personalize your experience, head to the Profile tab next.": "• După logare, vei ajunge pe ecranul principal Acasă. Pentru a-ți personaliza experiența, accesează secțiunea Profil.",
    "2. Profile Setup": "2. Configurarea Profilului",
    "• In your Profile, enter your personal metrics (height, weight, age, gender).": "• În Profil introdu metricile tale personale (înălțime, greutate, vârstă, gen).",
    "• These details help us tailor meal plans, workouts, and track progress.": "• Aceste detalii ne ajută să personalizăm planurile alimentare, antrenamentele și să urmărim progresul.",
    "3. Meal Planning": "3. Planificarea meselor",
    "• Go to the Meal tab to view your daily calories and macronutrients.": "• Accesează secțiunea Mese pentru a vizualiza caloriile și macronutrienții tăi zilnici.",
    "• Select a date to plan meals for any day.": "• Selectează o dată pentru a planifica mesele pentru orice zi.",
    "• Add meals (e.g., Breakfast, Lunch) and pick foods from categorized database lists.": "• Adaugă mese (de exemplu mic dejun, prânz) și alege alimente din liste.",
    "• Drag & drop foods between meals or delete items as needed.": "• Plasează alimentele în mese sau șterge-le după cum este necesar.",
    "4. Workout Plans": "4. Planuri de Antrenament",
    "• In the Workout tab, view your personalized plan based on your selected training days.": "• În tab-ul Antrenamente vizualizează planul tău personalizat bazat pe numărul de zile de antrenament selectate.",
    "• Swap exercises with alternatives for the same muscle group.": "• Schimbă exercițiile cu alternative pentru aceeași grupă musculară.",
    "• Tap on any exercise to watch a demonstration video.": "• Apasă pe orice exercițiu pentru a viziona un videoclip demonstrativ.",
    "5. Home Overview": "5. Prezentarea meniului Acasă",
    "• See your current calories just like in Meal Tab.": "• Vezi caloriile tale curente la fel ca în tab-ul Mese.",
    "• Track weight progress on the interactive chart after each update.": "• Urmărește progresul greutății cu ajutorul graficului interactiv după fiecare actualizare.",
    "• Use the map to locate nearby gyms based on your current location.": "• Folosește harta pentru a găsi săli de sport din apropiere în funcție de locația ta curentă.",
    "• Quick access boxes:": "• Meniuri cu acces rapid:",
    "– App Guide (this screen)": "– Ghidul Aplicației (acest ecran)",
    "– Chat Rooms (discuss fitness & nutrition topics)": "– Subiecte de conversații (discuții despre fitness și nutriție)",
    "6. Settings": "6. Setări",
    "• Switch app language between English and Romanian anytime.": "• Schimbă limba aplicației între engleză și română oricând.",
    "Explore and enjoy your fitness journey!": "Explorează și bucură-te de călătoria ta în fitness!",
    "About MyFitGlyph": "Despre MyFitGlyph",
    "What Is MyFitGlyph?": "Ce este MyFitGlyph?",
    "MyFitGlyph is a comprehensive fitness and nutrition companion designed to help you track your meals, workouts, and overall progress in one place. Whether you're aiming to lose weight, build muscle, or maintain a healthier lifestyle, MyFitGlyph adapts to your goals.": "MyFitGlyph este un îndrumător în fitness și nutriție, conceput pentru a te ajuta să îți gestionezi mesele, antrenamentele și progresul general într-un singur loc. Indiferent dacă îți propui să slăbești, să crești în masă musculară sau să menții un stil de viață mai sănătos, MyFitGlyph se adaptează obiectivelor tale.",
    "Our Story": "Povestea Noastră",
    "This app began as my bachelor thesis project at university. As a student passionate about health and technology, I wanted to build a tool that combined robust tracking features with an intuitive, mobile-first design. Over months of research, development, and testing, MyFitGlyph evolved into the app you see today.": "Această aplicație a început ca proiectul meu de licență la facultate. Fiind un student pasionat de sănătate și tehnologie, am dorit să construiesc un instrument care să combine caracteristici robuste de urmărire cu un design intuitiv, orientat spre zona mobile. După luni de cercetare, dezvoltare și testare, MyFitGlyph a evoluat în aplicația pe care o vezi astăzi.",
    "About the Developer": "Despre Dezvoltator",
    "Hi! I'm Robert Cobzarencu, a computer science student who loves fitness. Through this project, I applied academic concepts in real-world app development, learning React Native, TypeScript, and user-centered design along the way.": "Salut! Sunt Robert Cobzarencu, un student la informatică economică pasionat de fitness. Prin acest proiect, am aplicat concepte academice în dezvoltarea de aplicații reale, învățând React Native, TypeScript și design centrat pe utilizator.",
    "Looking Ahead": "Privind înainte",
    "MyFitGlyph is just getting started. Future updates will include social features, personalized coaching insights, and expanded food and exercise databases. Stay tuned and thank you for being part of this journey!": "MyFitGlyph abia începe. Actualizările viitoare vor include funcții sociale, perspective personalizate de antrenament și baze de date extinse de alimente și exerciții. Rămâi conectat și îți mulțumesc că faci parte din această călătorie!",
    "Version 1.0 built with ❤️ by": "Versiunea 1.0 creată cu ❤️ de"
}